app/controllers/api/admin/audit_logs_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "audit_logs".* FROM "audit_logs" WHERE "audit_logs"."action" = $1 ORDER BY "audit_logs"."created_at" DESC LIMIT $2 OFFSET $3  [["action", "index"], ["LIMIT", 20], ["OFFSET", 0]]
---
      def index
        logs = AuditLog.includes(:admin).order(created_at: :desc)

        if params[:admin_id].present?
          logs = logs.where(admin_id: params[:admin_id])
        end

        if params[:resource_type].present?
          logs = logs.where(resource_type: params[:resource_type])
        end

        if params[:action].present?
          logs = logs.where(action: params[:action])
        end

        logs = logs.page(params[:page] || 1).per(params[:per_page] || 50)