app/controllers/api/admin/dashboard_controller.rb

      def index
        today = Date.current
        week_ago = 7.days.ago

        stats = {
          users_total: User.count,
          users_today: User.where("created_at >= ?", today.beginning_of_day).count,
          users_this_week: User.where("created_at >= ?", week_ago).count,
          teams_total: Team.count,
          teams_active: Team.active.count,
          point_actions_total: PointAction.count,
          point_actions_active: PointAction.active.count
---
SELECT COUNT(*) FROM "point_actions" WHERE "point_actions"."active" = $1  [["active", true]]
SELECT COUNT(*) FROM "teams" WHERE "teams"."active" = $1  [["active", true]]
SELECT COUNT(*) FROM "users" WHERE (created_at >= $1)  [[nil, "2026-06-20 00:00:00"]]