app/controllers/api/admin/point_transactions_controller.rb

      def index
        transactions = PointTransaction.includes(:user, :point_action).order(created_at: :desc)

        if params[:user_id].present?
          transactions = transactions.where(user_id: params[:user_id])
        end

        if params[:point_action_id].present?
          transactions = transactions.where(point_action_id: params[:point_action_id])
        end

        transactions = transactions.page(params[:page] || 1).per(params[:per_page] || 50)
---
SELECT "point_transactions".* FROM "point_transactions" ORDER BY "point_transactions"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]