app/controllers/api/admin/point_actions_controller.rb

SELECT "point_actions".* FROM "point_actions" ORDER BY "point_actions"."action_key" ASC
---
      def index
        actions = PointAction.order(:action_key)