app/controllers/api/admin/sessions_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."email" = $1 LIMIT $2  [["email", "admin@appperfil.cl"], ["LIMIT", 1]]
---
      def create
        admin = ::Admin.find_by(email: session_params[:email])