app/controllers/api/admin/teams_controller.rb

      def index
        teams = Team.order(:name)
---
SELECT "teams".* FROM "teams" ORDER BY "teams"."name" ASC