app/controllers/api/admin/users_controller.rb

      def index
        users = User.order(created_at: :desc)

        if params[:rut].present?
          users = users.where("rut LIKE ?", "%#{params[:rut]}%")
        end

        users = users.page(params[:page] || 1).per(params[:per_page] || 20)
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]