app/controllers/api/v1/teams_controller.rb

      def index
        teams = Team.active.order(:name)
        render json: { teams: teams.map { |t| team_response(t) } }
---
SELECT "teams".* FROM "teams" WHERE "teams"."active" = $1 ORDER BY "teams"."name" ASC  [["active", true]]