app/controllers/api/v1/users_controller.rb

      def create
        photo_url = PhotoUploader.upload(params[:photo])

        unless photo_url
          render json: { error: "Foto requerida o formato inválido (JPEG/PNG, máx 5MB)" }, status: :bad_request
          return
        end

        unless validate_consents
          render json: { error: "Consentimiento de foto es obligatorio" }, status: :bad_request
          return
        end

        user = User.new(
          rut: params[:rut],
          phone: format_phone(params[:phone]),
          password: params[:password],
          birth_month: params[:birth_month],
          birth_year: params[:birth_year],
          photo_url: photo_url,
          teams_ids: params[:teams_ids] || [],
          consents: params[:consents] || {},
          referred_by: params[:referred_by]
        )

        if user.teams_ids.present?
          valid_team_ids = Team.active.where(id: user.teams_ids).pluck(:id)
---
SELECT "teams"."id" FROM "teams" WHERE "teams"."active" = $1 AND "teams"."id" IN ($2, $3)  [["active", true], ["id", 1], ["id", 2]]

          end
        end

        if User.exists?(rut: user.rut)
---
SELECT 1 AS one FROM "users" WHERE "users"."rut" = $1 LIMIT $2  [["rut", "123456"], ["LIMIT", 1]]

        user.metadata = capture_request_metadata
        user.referral_code = generate_referral_code

        if user.save
---
INSERT INTO "users" ("rut", "phone", "birth_month", "birth_year", "photo_url", "teams_ids", "consents", "metadata", "referral_code", "referred_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"